app/views/tasks/index.html.erb

SELECT  "task_lists".* FROM "task_lists" WHERE "task_lists"."id" = ? LIMIT 1  [["id", 2]]
---
         -->
        <td><%= List.find(task.list_name).title %></td>