app/views/tasks/show.html.erb

  <strong>List:</strong>
  <%= List.find(@task.list_name).title %>
---
SELECT  "task_lists".* FROM "task_lists" WHERE "task_lists"."id" = ? LIMIT 1  [["id", 2]]