app/views/home/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---

<% user = User.find_by_id(session[:user_id]) %>

SELECT "tasks".* FROM "tasks"
---

<% Task.all.each do |task| %>