app/controllers/login_controller.rb

  def authenticate
  	user = User.find_by_username(params[:username])
  	user2 = User.find_by_password(params[:password])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "asf"]]
SELECT  "users".* FROM "users" WHERE "users"."password" = ? LIMIT 1  [["password", "bobsmith"]]