app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "description", "priority", "is_complete", "task_list_id", "user_id", "due_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save