app/views/task_lists/show.html.erb

<ul>
	<% list = TaskList.find(params[:id]) %>
	<% list.tasks.each do |task| %>
---
SELECT  "task_lists".* FROM "task_lists" WHERE "task_lists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."task_list_id" = ?  [["task_list_id", 1]]